#Function: from sinhala.romanization import transliterate. Two mode: "normal"(default) or "vain".
#编写于2016年3月20-22日。于吉林大学图书馆1楼大厅。
#Written in 20-22 March 2016 in the reading area of the 1 stock of the Library of Jilin University.

SinSlogList={'ෟ':'iu','ෳ':'iū','ඏ':'iu','කෟ':'kiu','ඛෟ':'khiu','ගෟ':'giu','ඝෟ':'ghiu','ඞෟ':'ṅiu','ඟෟ':'ngiu','චෟ':'ciu','ඡෟ':'chiu','ජෟ':'jiu','ඣෟ':'jhiu','ඤෟ':'ñiu','ඥෟ':'gñiu','ඦෟ':'njiu','ටෟ':'ṭiu','ඨෟ':'ṭhiu','ඩෟ':'ḍiu','ඪෟ':'ḍhiu','ණෟ':'ṇiu','ඬෟ':'nḍiu','තෟ':'tiu','ථෟ':'thiu','දෟ':'diu','ධෟ':'dhiu','නෟ':'niu','ඳෟ':'ndiu','පෟ':'piu','ඵෟ':'phiu','බෟ':'biu','භෟ':'bhiu','මෟ':'miu','ඹෟ':'mbiu','යෟ':'yiu','රෟ':'riu','ලෟ':'liu','වෟ':'viu','ශෟ':'śiu','ෂෟ':'ṣiu','සෟ':'siu','හෟ':'hiu','ළෟ':'ḷiu','ෆෟ':'fiu','ඐ':'iū','කෳ':'kiū','ඛෳ':'khiū','ගෳ':'giū','ඝෳ':'ghiū','ඞෳ':'ṅiū','ඟෳ':'ngiū','චෳ':'ciū','ඡෳ':'chiū','ජෳ':'jiū','ඣෳ':'jhiū','ඤෳ':'ñiū','ඥෳ':'gñiū','ඦෳ':'njiū','ටෳ':'ṭiū','ඨෳ':'ṭhiū','ඩෳ':'ḍiū','ඪෳ':'ḍhiū','ණෳ':'ṇiū','ඬෳ':'nḍiū','තෳ':'tiū','ථෳ':'thiū','දෳ':'diū','ධෳ':'dhiū','නෳ':'niū','ඳෳ':'ndiū','පෳ':'piū','ඵෳ':'phiū','බෳ':'biū','භෳ':'bhiū','මෳ':'miū','ඹෳ':'mbiū','යෳ':'yiū','රෳ':'riū','ලෳ':'liū','වෳ':'viū','ශෳ':'śiū','ෂෳ':'ṣiū','සෳ':'siū','හෳ':'hiū','ළෳ':'ḷiū','ෆෳ':'fiū','්':'a','ා':'ā','ැ':'æ','ෑ':'ǣ','ි':'i','ී':'ī','ු':'u','ූ':'ū','ෘ':'iu','ෙ':'e','ේ':'ē','ෛ':'ai','ො':'o','ෝ':'ō','ෞ':'au','ෲ':'iū','ක':'ka','ඛ':'kha','ග':'ga','ඝ':'gha','ඞ':'ṅa','ඟ':'nga','ච':'ca','ඡ':'cha','ජ':'ja','ඣ':'jha','ඤ':'ña','ඥ':'gña','ඦ':'nja','ට':'ṭa','ඨ':'ṭha','ඩ':'ḍa','ඪ':'ḍha','ණ':'ṇa','ඬ':'nḍa','ත':'ta','ථ':'tha','ද':'da','ධ':'dha','න':'na','ඳ':'nda','ප':'pa','ඵ':'pha','බ':'ba','භ':'bha','ම':'ma','ඹ':'mba','ය':'ya','ර':'ra','ල':'la','ව':'va','ශ':'śa','ෂ':'ṣa','ස':'sa','හ':'ha','ළ':'ḷa','ෆ':'fa','අ':'a','ක්':'k','ඛ්':'kh','ග්':'g','ඝ්':'gh','ඞ්':'ṅ','ඟ්':'ng','ච්':'c','ඡ්':'ch','ජ්':'j','ඣ්':'jh','ඤ්':'ñ','ඥ්':'gñ','ඦ්':'nj','ට්':'ṭ','ඨ්':'ṭh','ඩ්':'ḍ','ඪ්':'ḍh','ණ්':'ṇ','ඬ්':'nḍ','ත්':'t','ථ්':'th','ද්':'d','ධ්':'dh','න්':'n','ඳ්':'nd','ප්':'p','ඵ්':'ph','බ්':'b','භ්':'bh','ම්':'m','ඹ්':'mb','ය්':'y','ර්':'r','ල්':'l','ව්':'v','ශ්':'ś','ෂ්':'ṣ','ස්':'s','හ්':'h','ළ්':'ḷ','ෆ්':'f','ආ':'ā','කා':'kā','ඛා':'khā','ගා':'gā','ඝා':'ghā','ඞා':'ṅā','ඟා':'ngā','චා':'cā','ඡා':'chā','ජා':'jā','ඣා':'jhā','ඤා':'ñā','ඥා':'gñā','ඦා':'njā','ටා':'ṭā','ඨා':'ṭhā','ඩා':'ḍā','ඪා':'ḍhā','ණා':'ṇā','ඬා':'nḍā','තා':'tā','ථා':'thā','දා':'dā','ධා':'dhā','නා':'nā','ඳා':'ndā','පා':'pā','ඵා':'phā','බා':'bā','භා':'bhā','මා':'mā','ඹා':'mbā','යා':'yā','රා':'rā','ලා':'lā','වා':'vā','ශා':'śā','ෂා':'ṣā','සා':'sā','හා':'hā','ළා':'ḷā','ෆා':'fā','ඇ':'æ','කැ':'kæ','ඛැ':'khæ','ගැ':'gæ','ඝැ':'ghæ','ඞැ':'ṅæ','ඟැ':'ngæ','චැ':'cæ','ඡැ':'chæ','ජැ':'jæ','ඣැ':'jhæ','ඤැ':'ñæ','ඥැ':'gñæ','ඦැ':'njæ','ටැ':'ṭæ','ඨැ':'ṭhæ','ඩැ':'ḍæ','ඪැ':'ḍhæ','ණැ':'ṇæ','ඬැ':'nḍæ','තැ':'tæ','ථැ':'thæ','දැ':'dæ','ධැ':'dhæ','නැ':'næ','ඳැ':'ndæ','පැ':'pæ','ඵැ':'phæ','බැ':'bæ','භැ':'bhæ','මැ':'mæ','ඹැ':'mbæ','යැ':'yæ','රැ':'ræ','ලැ':'læ','වැ':'væ','ශැ':'śæ','ෂැ':'ṣæ','සැ':'sæ','හැ':'hæ','ළැ':'ḷæ','ෆැ':'fæ','ඈ':'ǣ','කෑ':'kǣ','ඛෑ':'khǣ','ගෑ':'gǣ','ඝෑ':'ghǣ','ඞෑ':'ṅǣ','ඟෑ':'ngǣ','චෑ':'cǣ','ඡෑ':'chǣ','ජෑ':'jǣ','ඣෑ':'jhǣ','ඤෑ':'ñǣ','ඥෑ':'gñǣ','ඦෑ':'njǣ','ටෑ':'ṭǣ','ඨෑ':'ṭhǣ','ඩෑ':'ḍǣ','ඪෑ':'ḍhǣ','ණෑ':'ṇǣ','ඬෑ':'nḍǣ','තෑ':'tǣ','ථෑ':'thǣ','දෑ':'dǣ','ධෑ':'dhǣ','නෑ':'nǣ','ඳෑ':'ndǣ','පෑ':'pǣ','ඵෑ':'phǣ','බෑ':'bǣ','භෑ':'bhǣ','මෑ':'mǣ','ඹෑ':'mbǣ','යෑ':'yǣ','රෑ':'rǣ','ලෑ':'lǣ','වෑ':'vǣ','ශෑ':'śǣ','ෂෑ':'ṣǣ','සෑ':'sǣ','හෑ':'hǣ','ළෑ':'ḷǣ','ෆෑ':'fǣ','ඉ':'i','කි':'ki','ඛි':'khi','ගි':'gi','ඝි':'ghi','ඞි':'ṅi','ඟි':'ngi','චි':'ci','ඡි':'chi','ජි':'ji','ඣි':'jhi','ඤි':'ñi','ඥි':'gñi','ඦි':'nji','ටි':'ṭi','ඨි':'ṭhi','ඩි':'ḍi','ඪි':'ḍhi','ණි':'ṇi','ඬි':'nḍi','ති':'ti','ථි':'thi','දි':'di','ධි':'dhi','නි':'ni','ඳි':'ndi','පි':'pi','ඵි':'phi','බි':'bi','භි':'bhi','මි':'mi','ඹි':'mbi','යි':'yi','රි':'ri','ලි':'li','වි':'vi','ශි':'śi','ෂි':'ṣi','සි':'si','හි':'hi','ළි':'ḷi','ෆි':'fi','ඊ':'ī','කී':'kī','ඛී':'khī','ගී':'gī','ඝී':'ghī','ඞී':'ṅī','ඟී':'ngī','චී':'cī','ඡී':'chī','ජී':'jī','ඣී':'jhī','ඤී':'ñī','ඥී':'gñī','ඦී':'njī','ටී':'ṭī','ඨී':'ṭhī','ඩී':'ḍī','ඪී':'ḍhī','ණී':'ṇī','ඬී':'nḍī','තී':'tī','ථී':'thī','දී':'dī','ධී':'dhī','නී':'nī','ඳී':'ndī','පී':'pī','ඵී':'phī','බී':'bī','භී':'bhī','මී':'mī','ඹී':'mbī','යී':'yī','රී':'rī','ලී':'lī','වී':'vī','ශී':'śī','ෂී':'ṣī','සී':'sī','හී':'hī','ළී':'ḷī','ෆී':'fī','උ':'u','කු':'ku','ඛු':'khu','ගු':'gu','ඝු':'ghu','ඞු':'ṅu','ඟු':'ngu','චු':'cu','ඡු':'chu','ජු':'ju','ඣු':'jhu','ඤු':'ñu','ඥු':'gñu','ඦු':'nju','ටු':'ṭu','ඨු':'ṭhu','ඩු':'ḍu','ඪු':'ḍhu','ණු':'ṇu','ඬු':'nḍu','තු':'tu','ථු':'thu','දු':'du','ධු':'dhu','නු':'nu','ඳු':'ndu','පු':'pu','ඵු':'phu','බු':'bu','භු':'bhu','මු':'mu','ඹු':'mbu','යු':'yu','රු':'ru','ලු':'lu','වු':'vu','ශු':'śu','ෂු':'ṣu','සු':'su','හු':'hu','ළු':'ḷu','ෆු':'fu','ඌ':'ū','කූ':'kū','ඛූ':'khū','ගූ':'gū','ඝූ':'ghū','ඞූ':'ṅū','ඟූ':'ngū','චූ':'cū','ඡූ':'chū','ජූ':'jū','ඣූ':'jhū','ඤූ':'ñū','ඥූ':'gñū','ඦූ':'njū','ටූ':'ṭū','ඨූ':'ṭhū','ඩූ':'ḍū','ඪූ':'ḍhū','ණූ':'ṇū','ඬූ':'nḍū','තූ':'tū','ථූ':'thū','දූ':'dū','ධූ':'dhū','නූ':'nū','ඳූ':'ndū','පූ':'pū','ඵූ':'phū','බූ':'bū','භූ':'bhū','මූ':'mū','ඹූ':'mbū','යූ':'yū','රූ':'rū','ලූ':'lū','වූ':'vū','ශූ':'śū','ෂූ':'ṣū','සූ':'sū','හූ':'hū','ළූ':'ḷū','ෆූ':'fū','ඍ':'iu','කෘ':'kiu','ඛෘ':'khiu','ගෘ':'giu','ඝෘ':'ghiu','ඞෘ':'ṅiu','ඟෘ':'ngiu','චෘ':'ciu','ඡෘ':'chiu','ජෘ':'jiu','ඣෘ':'jhiu','ඤෘ':'ñiu','ඥෘ':'gñiu','ඦෘ':'njiu','ටෘ':'ṭiu','ඨෘ':'ṭhiu','ඩෘ':'ḍiu','ඪෘ':'ḍhiu','ණෘ':'ṇiu','ඬෘ':'nḍiu','තෘ':'tiu','ථෘ':'thiu','දෘ':'diu','ධෘ':'dhiu','නෘ':'niu','ඳෘ':'ndiu','පෘ':'piu','ඵෘ':'phiu','බෘ':'biu','භෘ':'bhiu','මෘ':'miu','ඹෘ':'mbiu','යෘ':'yiu','රෘ':'riu','ලෘ':'liu','වෘ':'viu','ශෘ':'śiu','ෂෘ':'ṣiu','සෘ':'siu','හෘ':'hiu','ළෘ':'ḷiu','ෆෘ':'fiu','එ':'e','කෙ':'ke','ඛෙ':'khe','ගෙ':'ge','ඝෙ':'ghe','ඞෙ':'ṅe','ඟෙ':'nge','චෙ':'ce','ඡෙ':'che','ජෙ':'je','ඣෙ':'jhe','ඤෙ':'ñe','ඥෙ':'gñe','ඦෙ':'nje','ටෙ':'ṭe','ඨෙ':'ṭhe','ඩෙ':'ḍe','ඪෙ':'ḍhe','ණෙ':'ṇe','ඬෙ':'nḍe','තෙ':'te','ථෙ':'the','දෙ':'de','ධෙ':'dhe','නෙ':'ne','ඳෙ':'nde','පෙ':'pe','ඵෙ':'phe','බෙ':'be','භෙ':'bhe','මෙ':'me','ඹෙ':'mbe','යෙ':'ye','රෙ':'re','ලෙ':'le','වෙ':'ve','ශෙ':'śe','ෂෙ':'ṣe','සෙ':'se','හෙ':'he','ළෙ':'ḷe','ෆෙ':'fe','ඒ':'ē','කේ':'kē','ඛේ':'khē','ගේ':'gē','ඝේ':'ghē','ඞේ':'ṅē','ඟේ':'ngē','චේ':'cē','ඡේ':'chē','ජේ':'jē','ඣේ':'jhē','ඤේ':'ñē','ඥේ':'gñē','ඦේ':'njē','ටේ':'ṭē','ඨේ':'ṭhē','ඩේ':'ḍē','ඪේ':'ḍhē','ණේ':'ṇē','ඬේ':'nḍē','තේ':'tē','ථේ':'thē','දේ':'dē','ධේ':'dhē','නේ':'nē','ඳේ':'ndē','පේ':'pē','ඵේ':'phē','බේ':'bē','භේ':'bhē','මේ':'mē','ඹේ':'mbē','යේ':'yē','රේ':'rē','ලේ':'lē','වේ':'vē','ශේ':'śē','ෂේ':'ṣē','සේ':'sē','හේ':'hē','ළේ':'ḷē','ෆේ':'fē','ඓ':'ai','කෛ':'kai','ඛෛ':'khai','ගෛ':'gai','ඝෛ':'ghai','ඞෛ':'ṅai','ඟෛ':'ngai','චෛ':'cai','ඡෛ':'chai','ජෛ':'jai','ඣෛ':'jhai','ඤෛ':'ñai','ඥෛ':'gñai','ඦෛ':'njai','ටෛ':'ṭai','ඨෛ':'ṭhai','ඩෛ':'ḍai','ඪෛ':'ḍhai','ණෛ':'ṇai','ඬෛ':'nḍai','තෛ':'tai','ථෛ':'thai','දෛ':'dai','ධෛ':'dhai','නෛ':'nai','ඳෛ':'ndai','පෛ':'pai','ඵෛ':'phai','බෛ':'bai','භෛ':'bhai','මෛ':'mai','ඹෛ':'mbai','යෛ':'yai','රෛ':'rai','ලෛ':'lai','වෛ':'vai','ශෛ':'śai','ෂෛ':'ṣai','සෛ':'sai','හෛ':'hai','ළෛ':'ḷai','ෆෛ':'fai','ඔ':'o','කො':'ko','ඛො':'kho','ගො':'go','ඝො':'gho','ඞො':'ṅo','ඟො':'ngo','චො':'co','ඡො':'cho','ජො':'jo','ඣො':'jho','ඤො':'ño','ඥො':'gño','ඦො':'njo','ටො':'ṭo','ඨො':'ṭho','ඩො':'ḍo','ඪො':'ḍho','ණො':'ṇo','ඬො':'nḍo','තො':'to','ථො':'tho','දො':'do','ධො':'dho','නො':'no','ඳො':'ndo','පො':'po','ඵො':'pho','බො':'bo','භො':'bho','මො':'mo','ඹො':'mbo','යො':'yo','රො':'ro','ලො':'lo','වො':'vo','ශො':'śo','ෂො':'ṣo','සො':'so','හො':'ho','ළො':'ḷo','ෆො':'fo','ඕ':'ō','කෝ':'kō','ඛෝ':'khō','ගෝ':'gō','ඝෝ':'ghō','ඞෝ':'ṅō','ඟෝ':'ngō','චෝ':'cō','ඡෝ':'chō','ජෝ':'jō','ඣෝ':'jhō','ඤෝ':'ñō','ඥෝ':'gñō','ඦෝ':'njō','ටෝ':'ṭō','ඨෝ':'ṭhō','ඩෝ':'ḍō','ඪෝ':'ḍhō','ණෝ':'ṇō','ඬෝ':'nḍō','තෝ':'tō','ථෝ':'thō','දෝ':'dō','ධෝ':'dhō','නෝ':'nō','ඳෝ':'ndō','පෝ':'pō','ඵෝ':'phō','බෝ':'bō','භෝ':'bhō','මෝ':'mō','ඹෝ':'mbō','යෝ':'yō','රෝ':'rō','ලෝ':'lō','වෝ':'vō','ශෝ':'śō','ෂෝ':'ṣō','සෝ':'sō','හෝ':'hō','ළෝ':'ḷō','ෆෝ':'fō','ඖ':'au','කෞ':'kau','ඛෞ':'khau','ගෞ':'gau','ඝෞ':'ghau','ඞෞ':'ṅau','ඟෞ':'ngau','චෞ':'cau','ඡෞ':'chau','ජෞ':'jau','ඣෞ':'jhau','ඤෞ':'ñau','ඥෞ':'gñau','ඦෞ':'njau','ටෞ':'ṭau','ඨෞ':'ṭhau','ඩෞ':'ḍau','ඪෞ':'ḍhau','ණෞ':'ṇau','ඬෞ':'nḍau','තෞ':'tau','ථෞ':'thau','දෞ':'dau','ධෞ':'dhau','නෞ':'nau','ඳෞ':'ndau','පෞ':'pau','ඵෞ':'phau','බෞ':'bau','භෞ':'bhau','මෞ':'mau','ඹෞ':'mbau','යෞ':'yau','රෞ':'rau','ලෞ':'lau','වෞ':'vau','ශෞ':'śau','ෂෞ':'ṣau','සෞ':'sau','හෞ':'hau','ළෞ':'ḷau','ෆෞ':'fau','ඎ':'iū','කෲ':'kiū','ඛෲ':'khiū','ගෲ':'giū','ඝෲ':'ghiū','ඞෲ':'ṅiū','ඟෲ':'ngiū','චෲ':'ciū','ඡෲ':'chiū','ජෲ':'jiū','ඣෲ':'jhiū','ඤෲ':'ñiū','ඥෲ':'gñiū','ඦෲ':'njiū','ටෲ':'ṭiū','ඨෲ':'ṭhiū','ඩෲ':'ḍiū','ඪෲ':'ḍhiū','ණෲ':'ṇiū','ඬෲ':'nḍiū','තෲ':'tiū','ථෲ':'thiū','දෲ':'diū','ධෲ':'dhiū','නෲ':'niū','ඳෲ':'ndiū','පෲ':'piū','ඵෲ':'phiū','බෲ':'biū','භෲ':'bhiū','මෲ':'miū','ඹෲ':'mbiū','යෲ':'yiū','රෲ':'riū','ලෲ':'liū','වෲ':'viū','ශෲ':'śiū','ෂෲ':'ṣiū','සෲ':'siū','හෲ':'hiū','ළෲ':'ḷiū','ෆෲ':'fiū','ං':'ṅ','ඃ':'h',b'\xe2\x80\x8d'.decode('utf-8'):''}

def isSin(astr):
    return ((astr >='ං') and (astr<'෴')) or astr=='\u200d'

def Romanise(textSin):
    i=0
    j=0
    trans=''
    while i+j<len(textSin):
        while not ((textSin[i:i+j] in SinSlogList and textSin[i:i+j+1] not in SinSlogList) or i+j>=len(textSin)):
            j+=1
        Slog=textSin[i:i+j]
        trans+=SinSlogList[Slog]
        i=i+j
        j=0
    return trans

def SinRom(Sinhalese):
    w=''
    t=''
    for s in Sinhalese:
        if isSin(s):
            w+=s
            continue
        else:
            t+=Romanise(w)
            w=''
            if not isSin(s):
                    t+=s
    t+=Romanise(w)
    trans=t
    return trans

def VainRomanise(OnceRomanised):
    VainRomaniseDict={'ā':'aa','æ':'A','ǣ':'AA','ī':'ii','ū':'uu','ē':'ee','ō':'oo','ṅ':'n','ñ':'ny','ṭ':'T','ḍ':'D','ṇ':'N','ś':'sh','ṣ':'sh','ḷ':'l'}
    VainRomanised=OnceRomanised
    for items in VainRomaniseDict:
        VainRomanised=VainRomanised.replace(items,VainRomaniseDict[items])
    return VainRomanised

def transliterate(text,mode="normal"):
    mode = mode.lower()
    if mode=="normal":
        return SinRom(text)
    elif mode=="vain":
        return VainRomanise(SinRom(text))
